# taps
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "mongodb/brew"
tap "uptech/oss"

# packages
brew "agg"
brew "angle-grinder"
brew "awscli"
brew "icu4c@76"
brew "cmake"
brew "curl"
brew "direnv"
brew "dpkg"
brew "libsodium"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golang-migrate"
brew "grip"
brew "gum"
brew "hadolint"
brew "hub"
brew "jemalloc"
brew "jo"
brew "jq"
brew "mise"
brew "node"
brew "mvfst"
brew "nmap"
brew "openjdk"
brew "php"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "postgresql@16", restart_service: true
brew "pyenv"
brew "python-setuptools"
brew "rabbitmq", restart_service: true
brew "ruby-build"
brew "redis", restart_service: true
brew "ripgrep"
brew "selecta"
brew "shellcheck"
brew "telnet"
brew "terraform"
brew "tmux"
brew "tree"
brew "util-linux"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
brew "z"
brew "zsh"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-community"
brew "uptech/oss/alt"

# casks
cask "session-manager-plugin"
cask "sfdx"
cask "swiftbar"
